projects/09_mixing_t_junction/0/epsilon
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 0.0495;

boundaryField
{
    mainInlet
    {
        type            fixedValue;
        value           uniform 0.0495;
    }

    branchInlet
    {
        type            fixedValue;
        value           uniform 0.00877;
    }

    outlet
    {
        type            zeroGradient;
    }

    walls
    {
        type            epsilonWallFunction;
        value           uniform 0.0495;
    }

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
