projects/09_mixing_t_junction/constant/thermophysicalProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            heRhoThermo;
    mixture         pureMixture;
    transport       const;
    thermo          hConst;
    equationOfState perfectGas;
    specie          specie;
    energy          sensibleEnthalpy;
}

mixture
{
    specie
    {
        molWeight   18.0;
    }

    thermodynamics
    {
        Cp          4182;
        Hf          0;
    }

    transport
    {
        mu          1e-03;
        Pr          7.0;
    }
}

// ************************************************************************* //
